tabs_munilevel_chop = {
    "男女_年齢_人口":("GET_DATA_CATALOG","DATA_CATALOG_LIST_INF","DATA_CATALOG_INF", "RESOURCES", "RESOURCE", "URL"),
    "男女_産業_職業者数":("GET_DATA_CATALOG","DATA_CATALOG_LIST_INF","DATA_CATALOG_INF", "RESOURCES", "RESOURCE", "URL"), 
    "男女_職業_職業者数":("GET_DATA_CATALOG","DATA_CATALOG_LIST_INF","DATA_CATALOG_INF", "RESOURCES", "RESOURCE", "URL")
}
tabs_munilevel_remrows = {
    "男女_年齢_人口":(0,1,2,3),
    "男女_産業_職業者数":(0,1,2), # industry
    "男女_職業_職業者数":(0,1,2) # occupaton
}
tabs_munilevel_remcols = {
    "男女_年齢_人口":(0,8,9,10,11,13,14,15,32,33,34,35,36,37,38,39,40,41,42),
    "男女_産業_職業者数":(0,8,9,10,11,14,34,35,36), # industry
    "男女_職業_職業者数":(0,8,9,10,11) # occupaton
}
tabs_munilevel_mergecols = {
    "男女_年齢_人口":{'95以上':(32,33)},
    "男女_産業_職業者数":{}, # industry
    "男女_職業_職業者数":{} # occupaton
}
tabs_munilevel_headers = {
    "男女_年齢_人口":("男女","市区町村コード","町丁字コード","temp_level","秘匿処理","秘匿先情報","合算地域", "総数",
                    "15-19","20-24",
                    "25-29","30-34","35-39",
                    "40-44","45-49","50-54",
                    "55-59","60-64","65-69",
                    "70-74","75-79","80-84",
                    "85-89","90-94","95以上"	
                    ),
    "男女_産業_職業者数":("男女",
                        "市区町村コード",
                        "町丁字コード",
                        "temp_level",
                        "秘匿処理",
                        "秘匿先情報",
                        "合算地域",
                        "総数",
                        "農業，林業",
                        "漁業",
                        "鉱業，採石業，砂利採取業",
                        "建設業",
                        "製造業",
                        "電気・ガス・熱供給・水道業",
                        "情報通信業",
                        "運輸業，郵便業",
                        "卸売業，小売業",
                        "金融業，保険業",
                        "不動産業，物品賃貸業",
                        "学術研究，専門・技術サービス業",
                        "宿泊業，飲食サービス業",
                        "生活関連サービス業，娯楽業",
                        "教育，学習支援業",
                        "医療，福祉",
                        "複合サービス事業",
                        "サービス業（他に分類されないもの）",
                        "公務（他に分類されるものを除く）",
                        "分類不能の産業"), # industry
    "男女_職業_職業者数":("男女",
                        "市区町村コード",
                        "町丁字コード",
                        "temp_level",
                        "秘匿処理",
                        "秘匿先情報",
                        "合算地域",
                        "総数",
                        '管理的職業従事者',
                        '専門的・技術的職業従事者',
                        '事務従事者',
                        '販売従事者',
                        'サービス職業従事者',
                        '保安職業従事者',
                        '農林漁業従事者',
                        '生産工程従事者',
                        '輸送・機械運転従事者',
                        '建設・採掘従事者',
                        '運搬・清掃・包装等従事者',
                        '分類不能の職業') # occupaton
}
tabs_munilevel_indices = {
    "男女_年齢_人口":3,
    "男女_産業_職業者数":3, # industry
    "男女_職業_職業者数":3 # occupaton
}
tabs_preflevel_chop = {"男女_年齢_職業_産業":("GET_STATS_DATA", "STATISTICAL_DATA", "DATA_INF", "VALUE")}
tabs_preflevel_reps = {
    "男女_年齢_職業_産業": {
        "@tab" : ({"2020_05":"2020"}),
        #"@cat01": ({"0":"男女"},{"1":"男"},{"2":"女"}),
        "@cat01": ({"1":"男"},{"2":"女"}),
        #"@cat02": ({"00":"総数" },{"01":"15-19"},{"02":"20-24"},
        "@cat02": ({"01":"15-19"},{"02":"20-24"},
                   {"03":"25-29"},{"04":"30-34"},{"05":"35-39"},
                   {"06":"40-44"},{"07":"45-49"},{"08":"50-54"},
                   {"09":"55-59"},{"10":"60-64"},{"11":"65-69"},
                   {"12":"70-74"},{"13":"75-79"},{"14":"80-84"},
                   {"15":"85-89"},{"16":"90-94"},{"17":"95以上"}),
        #"@cat03": ({"0":"総数" },{"A":"農業，林業"},{"B":"漁業"},
        "@cat03": ({"A":"農業，林業"},{"B":"漁業"},
                   {"C":'鉱業，採石業，砂利採取業'},{"D":'建設業'},
                   {"E":'製造業'},{"F":'電気・ガス・熱供給・水道業'},
                   {"G":'情報通信業'},{"H":'運輸業，郵便業'},{"I":'卸売業，小売業'},
                   {"J":'金融業，保険業'},{"K":'不動産業，物品賃貸業'},
                   {"L":'学術研究，専門・技術サービス業'},
                   {"M":'宿泊業，飲食サービス業'},{"N":'生活関連サービス業，娯楽業'},
                   {"O":'教育，学習支援業'},{"P":'医療，福祉'},{"Q":'複合サービス事業'},
                   {"R":'サービス業（他に分類されないもの）'},
                   {"S":'公務（他に分類されるものを除く）'},{"T":'分類不能の産業'}), 
        "@cat04": (
                   {"A":'管理的職業従事者'},
                   {"B":'専門的・技術的職業従事者'},
                   {"C":'事務従事者'},
                   {"D":'販売従事者'},
                   {"E":'サービス職業従事者'},
                   {"F":'保安職業従事者'},
                   {"G":'農林漁業従事者'},
                   {"H":'生産工程従事者'},
                   {"I":'輸送・機械運転従事者'},
                   {"J":'建設・採掘従事者'},
                   {"K":'運搬・清掃・包装等従事者'},
                   {"L":'分類不能の職業'}),  
        "@area": ({'19000':'19000'}), 
        "@time": ({'2020000000':'2020'})
    }
}